const { cmd } = require('../command')

cmd({
  pattern: "grade6",
  description: "Display Grade 6",
  filename: _filename,
  category: "inform"
},
  async(conn, mek, m { from }) => {
    const caption = `*ʜᴇʟʟᴏ* ʜᴏᴡ ᴀʀᴇ ʏᴏᴜ..*❤️‍🩹

*ʏᴏᴜ ᴀʀᴇ ꜱᴇʟᴇᴄᴛᴇᴅ ɢʀᴀᴅᴇ* 0⃣6⃣

⭐ ʏᴏᴜʀ - ᴍᴇɴᴜ ⭐

╭─────────────✑

*ᴘʟᴇᴀꜱᴇ ꜱᴇʟᴇᴄᴛ ᴏɴᴇ*

⭐│ *1*    *ᴘᴜᴘɪʟꜱ ʙᴏᴏᴋꜱ📚*
⭐│ *2*    *ꜰɪʀꜱᴛ ᴛᴇʀᴍ ᴛᴇꜱᴛ ᴘᴀᴘᴇʀ 📋*
⭐│ *3*    *ꜱᴇᴄᴏɴᴅ ᴛᴇʀᴍ ᴛᴇꜱᴛ ᴘᴀᴘᴇʀ 📋*
⭐│ *4*    *ᴛʜɪʀᴅ ᴛᴇʀᴍ ᴛᴇꜱᴛ ᴘᴀᴘᴇʀ 📋*
⭐│ *5*    *ᴍᴏᴅʟᴇ  ᴘᴀᴘᴇʀ📋*

╰─────────────✑
*𝚙𝚘𝚠𝚎𝚛𝚎𝚍 𝚋𝚢 𝚌𝚑𝚊𝚛𝚞𝚔𝚊*`;
});
