const { cmd } = require('../command');

cmd({
    pattern: "help",
    desc: "Displays bot menu",
    category: "tools",
    filename: __filename
},
async (conn, mek, m, { from }) => {
    const caption = `*ꜰʀᴏᴍ ᴅᴇᴠᴇʟᴏᴘᴇʀ⭐*

*හායි කොහොමද ඉතින් ඔයාට ඔයා තාම හරියට අපේ වට්ස්ඇප් බොට්ව පාවිච්චි කරන්න දන් නැද්ද??*✌️

*කෙටි විස්තරයක් කියන්නම් බොට්ව පාවිච්චි කරන්න පුලුවන් විදිය ගැන මේ බොට්ගේ ප්‍රධාන කමාන්ඩ් හයක් තියෙනවා ඒ එක එක ගැන පැහැදිලි කරන්නම්*❤️‍🩹

*`01.video`📽️*

*ඉතිම් ඔයාට youtube එකෙන් මොකක් හරි වීඩීයෝ එකක් ඩවුන්ලෝඩ් කරගන්න ඕනීනම් ඔයා පාවිච්චි කරන්න ඕනේ මේ කමාන්ඩ් එක උදාහරණයක් ලෙස ඔයාට ලංකාව ගැන වීඩීයෝ එකක් ඔනීනම් ඔයාට කරන්න තියෙන්න* *.video sriLanka* *ඔය විදියට මැසේජ් එකක් එවන එක ඊට පස්සේ එකට අදාල වීඩීයෝ එකක් නිකම්ම ඔයාට සෙන්ඩ් වේවී..*⭐

*`02.ᴀᴜᴅɪᴏ🎶`*

*ඉතිම් ඔයාට youtube එකෙන් මොකක් හරි සිංදුවක්  ඩවුන්ලෝඩ් කරගන්න ඕනීනම් ඔයා පාවිච්චි කරන්න ඕනේ මේ කමාන්ඩ් එක උදාහරණයක් ලෙස ඔයාට සදක් වෙලා මනරම් සිංදුව  ඔනීනම් ඔයාට කරන්න තියෙන්න* *.audio සදක් වෙලා මනමරම්(ඔතන සිංහල වලින්ම ගහන්න ඕනී නෑ..ඉංග්‍රීසි වලින් උනත් කමක් නෑ..⭐❤️‍🩹)* *ඔය විදියට මැසේජ් එකක් එවන එක ඊට පස්සේ එකට අදාල සිංදුව නිකම්ම ඔයාට සෙන්ඩ් වේවී..*⭐

*`03.ʏᴛꜱᴇᴀʀᴄʜ🔍`*

*ඉතිම් යාලූවේ ඔයාට යූටියුබ් එකෙන් මොකක් හරි දෙයක් ගැන විස්තර හොයාගන්න ඕනීනම් ඔයා පාවිච්චි කරන්න ඕනී මේක⭐❤️‍🩹*

*`04.ᴘɪɴɢ📡`*

*බොට් ඔයාට කොච්චර වේගේකින් ʀᴇꜱᴘᴏɴꜱᴇ කරනවද කියලා බලන්න ඔය කමාන්ඩ් එක⭐*

*`05.ᴀʟɪᴠᴇ❄️`*

*බොට් වැඩද නැද්ද කියලා බලන්න ඔය කමාන්ඩ් එක❤️‍🩹⭐*

*`06.ꜱᴄ📜`*

*බොට්ගේ කෝඩ් එක ᴊᴀᴠᴀꜱᴄʀɪᴘᴛ එක ගන්න ඕනීනම් ඔය කමාන්ඩ් එක⭐*

*`.ᴍᴇɴᴜ🍦`*

*බොට්ගේ ප්‍රධාන මෙනුව බලන්න ඔය කමාන්ඩ් එක❤️‍🩹*

*𝚃𝙷𝙰𝙽𝙺𝚂 𝙵𝙾𝚁 𝚁𝙴𝙰𝙳 𝙲𝙷𝙰𝚁𝚄𝙺𝙰 𝙼𝙰𝙷𝙴𝚂𝙷⭐❤️‍🩹*

> 𝙱𝙻𝙰𝙲𝙺 𝙰𝙻𝙿𝙷𝙰 𝚂𝙾𝙽𝙶 𝙱𝙾𝚃 ❤️‍🩹✻`;

    const image = 'https://raw.githubusercontent.com/CharukaMahesh/song-bot-md/refs/heads/main/IMGES/20241210_214616.jpg';

    await conn.sendMessage(from, { image: { url: image }, caption: caption });
});
